---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.PlacementFailed
source: html/fd733756-fd68-4b47-0198-84ebdfe09c99.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.PlacementFailed Property

Failed to place component.

## Syntax (C#)
```csharp
public static FailureDefinitionId PlacementFailed { get; }
```